app/Controllers/ChatController.php

SELECT DISTINCT u.id, u.first_name, u.last_name, u.matricule, u.email, u.name_profile, u.pdp
FROM `utilisateur` `u`
JOIN `membre_conversation` `mc` ON `mc`.`id_user` = `u`.`id`
WHERE mc.id_conversation IN (SELECT `id_conversation`
FROM `membre_conversation`
WHERE `id_user` = '5')
AND `u`.`id` != '5'
---
    public function show()
    {
        $user_id = session('user_id'); // utilisateur courant
        $db = \Config\Database::connect();

        // Sous-requête : toutes les conversations de l'utilisateur
        $subQuery = $db->table('membre_conversation')
            ->select('id_conversation')
            ->where('id_user', $user_id)
            ->getCompiledSelect();

        // Requête principale : récupérer les autres utilisateurs dans ces conversations
        $builder = $db->table('utilisateur u')
            ->select('DISTINCT u.id, u.first_name, u.last_name, u.matricule, u.email, u.name_profile, u.pdp', false)
            ->join('membre_conversation mc', 'mc.id_user = u.id')
            ->where("mc.id_conversation IN ($subQuery)", null, false)
            ->where('u.id !=', $user_id);
        $users = $builder->get()->getResultArray(); // <-- retourne un tableau associatif

SELECT *
FROM `messages`
WHERE   (
`id_expediteur` = '6'
AND `id_recepteur` = '7'
 )
OR   (
`id_expediteur` = '7'
AND `id_recepteur` = '6'
 )
ORDER BY `created_at` ASC
---
    public function show_mess($id_recepteur)
    {
        $user_id = session('user_id');
        $model = new MessageModel();
        $user_model = new AuthModel();

        $messages = $model
            ->groupStart()
            ->where('id_expediteur', $user_id)
            ->where('id_recepteur', $id_recepteur)
            ->groupEnd()
            ->orGroupStart()
            ->where('id_expediteur', $id_recepteur)
            ->where('id_recepteur', $user_id)
            ->groupEnd()
            ->orderBy('created_at', 'ASC') // tri par date
            ->findAll();

SELECT *
FROM `messages`
WHERE   (
`id_expediteur` = '5'
AND `id_recepteur` = '3'
 )
OR   (
`id_expediteur` = '3'
AND `id_recepteur` = '5'
 )
ORDER BY `created_at` ASC
---
    public function fetchMessages($id_recepteur)
    {
        $user_id = session('user_id');
        $model = new MessageModel();

        $messages = $model
            ->groupStart()
            ->where('id_expediteur', $user_id)
            ->where('id_recepteur', $id_recepteur)
            ->groupEnd()
            ->orGroupStart()
            ->where('id_expediteur', $id_recepteur)
            ->where('id_recepteur', $user_id)
            ->groupEnd()
            ->orderBy('created_at', 'ASC')
            ->findAll();