app/Controllers/Pub.php

    public function suppression($pubId, $userId)
    {
        $pubModel = new PubModel();

        $publication = $pubModel->find($pubId);
        if ($publication && $publication['id_utilisateur'] == $userId) {
            $pubModel->delete($pubId);
---
DELETE FROM `publication`
WHERE `id` IN ('9')

    public function likeAjout($publicationID,$userId=null){
        $likeModel = new LikeModel();
        $pubModel = new PublicationModel();
        $publication = $pubModel->find($publicationID);
---
SELECT *
FROM `publication`
WHERE `publication`.`id` = '9'