app/Controllers/Publication.php

    public function creation($userId = null)
    {
        $pubModel = new PublicationModel();

        if (!$userId) {
            $userId = session()->get('id_utilisateur');
        }

        if ($this->request->getPost()) {
            $imageFile = $this->request->getFile('image');
            $imageNom = null;

            if ($imageFile && $imageFile->isValid() && !$imageFile->hasMoved()) {
                $imageNom = $imageFile->getRandomName();
                $imageFile->move(ROOTPATH . 'public/uploads', $imageNom);
            }

            $data = [
                'contenu'        => $this->request->getPost('contenu'),
                'image'          => $imageNom,
                '_date'          => date('Y-m-d H:i:s'),
                'id_utilisateur' => $userId
            ];

            $pubModel->save($data);
---
INSERT INTO `publication` (`contenu`, `image`, `_date`, `id_utilisateur`) VALUES ('mirado kosa euh', '1757861505_b9e64de2adc946041bc9.jpg', '2025-09-14 14:51:45', '1')

    public function likeAjout($publicationID,$userId=null){
        $likeModel = new LikeModel();
        $pubModel = new PublicationModel();
        $publication = $pubModel->find($publicationID);
        $publication = $pubModel->getPublicationWithUser($publicationID);
        $auteurName = $publication['userName'];
        $message = 'salut'.$auteurName;

        if (!$userId) {
            $userId = session()->get('id_utilisateur');
        }

        $data = [
            'id_utilisateur'=>$userId,
            'id_publication'=>$publicationID,
            'message'=> $message
        ];

        $likeModel->save($data);
---
SELECT *
FROM `publication`
WHERE `publication`.`id` = '2'
INSERT INTO `likes` (`id_utilisateur`, `id_publication`, `message`) VALUES ('1', '2', 'salutMirado')