app/Controllers/Publication.php

SELECT *
FROM `publication`
---
        public function index(){
            $pubModel = new PublicationModel();
            $data['publication'] = $pubModel->findAll();

INSERT INTO `publication` (`contenu`, `image`, `_date`) VALUES ('bonjours', '1757742219_179fed13e8814c9d41a4.jpg', '2025-09-13 05:43:39')
---
        public function creation(){
            $pubModel = new PublicationModel();
            if($this->request->getPost()){
                $imageFile = $this->request->getFile('image');
                $imageNom = null;

                if($imageFile && $imageFile->isValid() && ! $imageFile->hasMoved()){
                    $imageNom = $imageFile->getRandomName();
                    $imageFile->move(FCPATH . 'uploads' , $imageNom);
                }

                $data = [
                    'contenu'=> $this->request->getPost('contenu'),
                    'image'=>$imageNom,
                    '_date'=>date('Y-m-d H:i:s')

                ];

                $pubModel->save($data);