app/Models/PubModel.php

SELECT `publication`.*, `utilisateur`.`last_name` as `userName`
FROM `publication`
JOIN `utilisateur` ON `utilisateur`.`id` = `publication`.`id_utilisateur`
ORDER BY `publication`.`_date` DESC
---
    public function getAllPublications()
    {
        return $this->select('publication.*, utilisateur.last_name as userName')
                    ->join('utilisateur', 'utilisateur.id = publication.id_utilisateur')
                    ->orderBy('publication._date', 'DESC')
                    ->findAll();

SELECT `publication`.*, `utilisateur`.`last_name` as `userName`
FROM `publication`
JOIN `utilisateur` ON `utilisateur`.`id` = `publication`.`id_utilisateur`
WHERE `publication`.`id_utilisateur` = '6'
ORDER BY `publication`.`_date` DESC
---
    public function getPublicationsByUser($userId)
    {
        return $this->select('publication.*, utilisateur.last_name as userName')
                    ->join('utilisateur', 'utilisateur.id = publication.id_utilisateur')
                    ->where('publication.id_utilisateur', $userId)
                    ->orderBy('publication._date', 'DESC')
                    ->findAll();